frain1219/ZHIYUN_F100/SDK/APM32_USB_SDK_v1.1/Libraries/APM32L0xx_StdPeriphDriver/src/apm32l0xx_i2c.c
/*!
 * @file        apm32l0xx_i2c.c
 *
 * @brief       This file contains all the functions for the I2C peripheral
 *
 * @version     V1.0.0
 *
 * @date        2021-12-25
 *
 * @attention
 *
 *  Copyright (C) 2020-2023 Geehy Semiconductor
 *
 *  You may not use this file except in compliance with the
 *  GEEHY COPYRIGHT NOTICE (GEEHY SOFTWARE PACKAGE LICENSE).
 *
 *  The program is only for reference, which is distributed in the hope
 *  that it will be usefull and instructional for customers to develop
 *  their software. Unless required by applicable law or agreed to in
 *  writing, the program is distributed on an "AS IS" BASIS, WITHOUT
 *  ANY WARRANTY OR CONDITIONS OF ANY KIND, either express or implied.
 *  See the GEEHY SOFTWARE PACKAGE LICENSE for the governing permissions
 *  and limitations under the License.
 */

#include "apm32l0xx_i2c.h"
#include "apm32l0xx_rcm.h"

/** @addtogroup Peripherals_Library Standard Peripheral Library
  @{
*/

/** @addtogroup I2C_Driver I2C Driver
  @{
*/

/** @addtogroup I2C_Fuctions Fuctions
  @{
*/

/*!
 * @brief     Set the I2C peripheral registers to their default reset values
 *
 * @param     i2c: Select I2C peripheral,it can be I2C1/I2C2/I2C3.
 *
 * @retval    None
 */
void I2C_Reset(I2C_T* i2c)
{
    if (i2c == I2C1)
    {
        RCM_EnableAPB1PeriphReset(RCM_APB1_PERIPH_I2C1);
        RCM_DisableAPB1PeriphReset(RCM_APB1_PERIPH_I2C1);
    }
    else if (i2c == I2C2)
    {
        RCM_EnableAPB1PeriphReset(RCM_APB1_PERIPH_I2C2);
        RCM_DisableAPB1PeriphReset(RCM_APB1_PERIPH_I2C2);
    }
    else
    {
        RCM_EnableAPB1PeriphReset(RCM_APB1_PERIPH_I2C3);
        RCM_DisableAPB1PeriphReset(RCM_APB1_PERIPH_I2C3);
    }
}

/*!
 * @brief       Config the I2C peripheral according to the specified parameters in the adcConfig
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C2/I2C3.
 *
 * @param       adcConfig:  Pointer to a I2C_Config_T structure that
 *                          contains the configuration information for the I2C peripheral
 *
 * @retval      None
 */
void I2C_Config(I2C_T* i2c, I2C_Config_T* i2cConfig)
{
    uint32_t temp = 0;

    /** Disable I2C */
    i2c->CTRL1_B.I2CEN = BIT_RESET;

    /** FILTERS Configuration */
    temp = i2c->CTRL1;
    temp &= ((uint32_t)0x00CFE0FF);
    i2c->CTRL1_B.DNFCFG = i2cConfig->digitalfilter;
    i2c->CTRL1_B.ANFD = i2cConfig->analogfilter;

    /** TIMING Configuration */
    i2c->TIMING = i2cConfig-> timing & ((uint32_t)0xF0FFFFFF);

    /** Enable I2C */
    i2c->CTRL1_B.I2CEN = BIT_SET;

    /** ADDR1 Configuration */
    temp = 0;
    i2c->ADDR1 = 0;
    i2c->ADDR2 = 0;

    temp = (uint32_t)((uint32_t)i2cConfig->ackaddress << 10 | \
                      (uint32_t)i2cConfig->address1);

    /** Write to I2C ADDR1 */
    i2c->ADDR1 = temp;

    /** Enable Own Address1 acknowledgement */
    i2c->ADDR1_B.ADDR1EN  = BIT_SET;

    /** Mode Configuration */
    i2c->CTRL1 &= 0xFFCFFFF;
    temp = i2cConfig->mode;
    i2c->CTRL1 |= temp;

    /** Ack Configuration */
    i2c->CTRL2_B.NACKEN = i2cConfig->ack;
}

/*!
 * @brief       Fills each i2cConfig member with its default value
 *
 * @param       i2cConfig:    Pointer to a I2C_Config_T structure which will be initialized
 *
 * @retval      None
 */
void I2C_ConfigStructInit(I2C_Config_T* i2cConfig)
{
    i2cConfig->timing   = 0;
    i2cConfig->address1 = 0;
    i2cConfig->mode     = I2C_MODE_I2C;
    i2cConfig->analogfilter  = I2C_ANALOG_FILTER_ENABLE;
    i2cConfig->digitalfilter = I2C_DIGITAL_FILTER_0;

    i2cConfig->ack = I2C_ACK_DISABLE;
    i2cConfig->ackaddress = I2C_ACK_ADDRESS_7BIT;
}

/*!
 * @brief       Enable the I2C peripheral
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C2/I2C3.
 *
 * @retval      None
 */
void I2C_Enable(I2C_T* i2c)
{
    i2c->CTRL1_B.I2CEN = BIT_SET;
}

/*!
 * @brief       Disable the I2C peripheral
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C2/I2C3.
 *
 * @retval      None
 */
void I2C_Disable(I2C_T* i2c)
{
    i2c->CTRL1_B.I2CEN = BIT_RESET;
}

/*!
 * @brief       I2C Soft ware Reset
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C2/I2C3.
 *
 * @retval      None
 */
void I2C_SoftwareReset(I2C_T* i2c)
{
    i2c->CTRL1_B.I2CEN = BIT_RESET;
    *(__IO uint32_t*)(uint32_t)i2c;
    i2c->CTRL1_B.I2CEN = BIT_SET;
}

/*!
 * @brief       Enables the specified interrupts
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C2/I2C3.
 *
 * @param       interrupt:  Specifies the I2C interrupts sources
 *                          The parameter can be combination of following values:
 *                          @arg I2C_INT_TXIE:    TX Interrupt enable
 *                          @arg I2C_INT_RXIE:    RX Interrupt enable
 *                          @arg I2C_INT_ADDRIE:  Address match interrupt enable (slave only)
 *                          @arg I2C_INT_NACKIE:  Not acknowledge received interrupt enable
 *                          @arg I2C_INT_STOPIE:  STOP detection Interrupt enable
 *                          @arg I2C_INT_TXCIE:   Transfer complete interrupt enable
 *                          @arg I2C_INT_ERRIE:   Error interrupts enable
 *
 * @retval      None
 */
void I2C_EnableInterrupt(I2C_T* i2c, uint8_t interrupt)
{
    i2c->CTRL1 |= (uint32_t)interrupt;
}

/*!
 * @brief       Disable the specified interrupts
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C2/I2C3.
 *
 * @param       interrupt:  Specifies the I2C interrupts sources
 *                          The parameter can be combination of following values:
 *                          @arg I2C_INT_TXIE:    TX Interrupt enable
 *                          @arg I2C_INT_RXIE:    RX Interrupt enable
 *                          @arg I2C_INT_ADDRIE:  Address match interrupt enable (slave only)
 *                          @arg I2C_INT_NACKIE:  Not acknowledge received interrupt enable
 *                          @arg I2C_INT_STOPIE:  STOP detection Interrupt enable
 *                          @arg I2C_INT_TXCIE:   Transfer complete interrupt enable
 *                          @arg I2C_INT_ERRIE:   Error interrupts enable
 *
 * @retval      None
 */
void I2C_DisableInterrupt(I2C_T* i2c, uint8_t interrupt)
{
    i2c->CTRL1 &= (uint32_t)~interrupt;
}

/*!
 * @brief       Enables the stretch clock
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C2/I2C3.
 *
 * @retval      None
 */
void I2C_EnableStretchClock(I2C_T* i2c)
{
    i2c->CTRL1_B.CLKSTRETCHD = BIT_RESET;
}

/*!
 * @brief       Disables the stretch clock
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C2/I2C3.
 *
 * @retval      None
 */
void I2C_DisableStretchClock(I2C_T* i2c)
{
    i2c->CTRL1_B.CLKSTRETCHD = BIT_SET;
}

/*!
 * @brief       Enables the stop mode
 *
 * @param       i2c:   Select I2C peripheral, It can be I2C1/I2C3.
 *
 * @retval      None
 *
 */
void I2C_EnableStopMode(I2C_T* i2c)
{
    i2c->CTRL1_B.WUPEN = BIT_SET;
}

/*!
 * @brief       Disable the stop mode
 *
 * @param       i2c:   Select I2C peripheral, It can be I2C1/I2C3.
 *
 * @retval      None
 *
 */
void I2C_DisableStopMode(I2C_T* i2c)
{
    i2c->CTRL1_B.WUPEN = BIT_RESET;
}

/*!
 * @brief       Enables the I2C own address 2
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C2/I2C3.
 *
 * @retval      None
 */
void I2C_EnableOwnAddress2(I2C_T* i2c)
{
    i2c->ADDR2_B.ADDR2EN = BIT_SET;
}

/*!
 * @brief       Disables the I2C own address 2
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C2/I2C3.
 *
 * @retval      None
 */
void I2C_DisableOwnAddress2(I2C_T* i2c)
{
    i2c->ADDR2_B.ADDR2EN = BIT_RESET;
}

/*!
 * @brief       I2C slave own address 2 and mask
 *
 * @param       i2c:  Select I2C peripheral,it can be I2C1/I2C2/I2C3.
 *
 * @param       mask: Own address 2 mask selection
 *                    The parameter can be one of following values:
 *                    @arg I2C_ADDR2MSK_NOMASK: No masked
 *                    @arg I2C_ADDR2MSK_MASK01: Don't care masked ADDR2[1:0]
 *                    @arg I2C_ADDR2MSK_MASK02: Don't care masked ADDR2[2:1]
 *                    @arg I2C_ADDR2MSK_MASK03: Don't care masked ADDR2[3:1]
 *                    @arg I2C_ADDR2MSK_MASK04: Don't care masked ADDR2[4:1]
 *                    @arg I2C_ADDR2MSK_MASK05: Don't care masked ADDR2[5:1]
 *                    @arg I2C_ADDR2MSK_MASK06: Don't care masked ADDR2[6:1]
 *                    @arg I2C_ADDR2MSK_MASK07: Don't care masked ADDR2[7:1]
 *
 * @retval      None
 */
void I2C_OwnAddress2Mask(I2C_T* i2c, uint16_t address, I2C_ADDR2MSK_T mask)
{
    i2c->ADDR2_B.ADDR2 = address;
    i2c->ADDR2_B.ADDR2MSK = mask;

