frain1219/ZHIYUN_F100/SDK/APM32_USB_SDK_v1.1/Libraries/APM32L0xx_StdPeriphDriver/src/apm32l0xx_i2c.c
    /* clear temp specific bits */
    temp &= (uint32_t)~((uint32_t)(I2C_CTRL2_SADD | I2C_CTRL2_NUMBYT | I2C_CTRL2_MASK));

    /* update temp */
    temp |= (uint32_t)(((uint32_t)address & I2C_CTRL2_SADD) | (((uint32_t)number << 16 ) & I2C_CTRL2_NUMBYT) | \
                       (uint32_t)reloadend | (uint32_t)generates);

    /* update CTRL2 register */
    i2c->CTRL2 = temp;
}

/*!
 * @brief       Enables I2C SMBus alert
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C3.
 *
 * @retval      None
 */
void I2C_EnableSMBusAlert(I2C_T* i2c)
{
    i2c->CTRL1_B.ALTEN = BIT_SET;
}

/*!
 * @brief       Disables I2C SMBus alert
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C3.
 *
 * @retval      None
 */
void I2C_DisableSMBusAlert(I2C_T* i2c)
{
    i2c->CTRL1_B.ALTEN = BIT_RESET;
}

/*!
 * @brief       Enable I2C SMBus HADDREN
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C3.
 *
 * @retval      None
 */
void I2C_EnableSMBusHAEN(I2C_T* i2c)
{
    i2c->CTRL1_B.HADDREN = BIT_SET;
}

/*!
 * @brief       Disable I2C SMBus HADDREN
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C3.
 *
 * @retval      None
 */
void I2C_DisableSMBusHAEN(I2C_T* i2c)
{
    i2c->CTRL1_B.HADDREN = BIT_RESET;
}

/*!
 * @brief       Enable I2C SMBus DEADDREN
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C3.
 *
 * @retval      None
 */

void I2C_EnableSMBusDAEN(I2C_T* i2c)
{
    i2c->CTRL1_B.DEADDREN = BIT_SET;
}

/*!
 * @brief       Disable I2C SMBus DEADDREN
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C3.
 *
 * @retval      None
 */
void I2C_DisableSMBusDAEN(I2C_T* i2c)
{
    i2c->CTRL1_B.DEADDREN = BIT_RESET;
}

/*!
 * @brief       Enables I2C Clock Timeout
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C3.
 *
 * @retval      None
 */
void I2C_EnableClockTimeout(I2C_T* i2c)
{
    i2c->TIMEOUT_B.CLKTOEN = BIT_SET;
}

/*!
 * @brief       Disables I2C Clock Timeout
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C3.
 *
 * @retval      None
 */
void I2C_DisableClockTimeout(I2C_T* i2c)
{
    i2c->TIMEOUT_B.CLKTOEN = BIT_RESET;
}

/*!
 * @brief       Enables I2C Extend Clock Timeout
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C3.
 *
 * @retval      None
 */
void I2C_EnableExtendClockTimeout(I2C_T* i2c)
{
    i2c->TIMEOUT_B.EXCLKTOEN = BIT_SET;
}

/*!
 * @brief       Disables I2C Extend Clock Timeout
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C3.
 *
 * @retval      None
 */
void I2C_DisableExtendClockTimeout(I2C_T* i2c)
{
    i2c->TIMEOUT_B.EXCLKTOEN = BIT_RESET;
}

/*!
 * @brief       Enables I2C Idle Clock Timeout
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C3.
 *
 * @retval      None
 */
void I2C_EnableIdleClockTimeout(I2C_T* i2c)
{
    i2c->TIMEOUT_B.IDLECLKTO = BIT_SET;
}

/*!
 * @brief       Disables I2C Idle Clock Timeout
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C3.
 *
 * @retval      None
 */
void I2C_DisableIdleClockTimeout(I2C_T* i2c)
{
    i2c->TIMEOUT_B.IDLECLKTO = BIT_RESET;
}

/*!
 * @brief       Configures the I2C Bus Timeout A
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C3.
 *
 * @param       timeout: specifies the Timeout A to be programmed
 *
 * @retval      None
 */
void I2C_ConfigTimeoutA(I2C_T* i2c, uint16_t timeout)
{
    i2c->TIMEOUT_B.TIMEOUTA = timeout;
}

/*!
 * @brief       Configures the I2C Bus Timeout B
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C3.
 *
 * @param       timeout: specifies the Timeout B to be programmed
 *
 * @retval      None
 */
void I2C_ConfigTimeoutB(I2C_T* i2c, uint16_t timeout)
{
    i2c->TIMEOUT_B.TIMEOUTB = timeout;
}

/*!
 * @brief       Enables I2C PEC calculation
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C3.
 *
 * @retval      None
 */
void I2C_EnablePEC(I2C_T* i2c)
{
    i2c->CTRL1_B.PECEN = BIT_SET;
}

/*!
 * @brief       Disables I2C PEC calculation
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C3.
 *
 * @retval      None
 */
void I2C_DisablePEC(I2C_T* i2c)
{
    i2c->CTRL1_B.PECEN = BIT_RESET;
}

/*!
 * @brief       Enables I2C  Transfer Packet Error(PEC) Checking Byte
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C3.
 *
 * @retval      None
 */
void I2C_EnablePECRequest(I2C_T* i2c)
{
    i2c->CTRL2_B.PEC = BIT_SET;
}

/*!
 * @brief       Returns the I2C PEC
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C3.
 *
 * @retval      The value is PEC
 */
uint8_t I2C_ReadPEC(I2C_T* i2c)
{
    return ((uint8_t)i2c->PEC_B.PEC);
}

/*!
 * @brief       Reads the specified I2C register and returns its value
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C2/I2C3.
 *
 * @param       registers:  Specifies the I2C interrupts sources
 *                          The parameter can be one of following values:
 *                          @arg I2C_REGISTER_CTRL1:    CTRL1 register
 *                          @arg I2C_REGISTER_CTRL2:    CTRL2 register
 *                          @arg I2C_REGISTER_ADDR1:    ADDR1 register
 *                          @arg I2C_REGISTER_ADDR2:    ADDR2 register
 *                          @arg I2C_REGISTER_TIMING:   TIMING register
 *                          @arg I2C_REGISTER_TIMEOUT:  TIMEOUT register
 *                          @arg I2C_REGISTER_STS:      STS register
 *                          @arg I2C_REGISTER_INTFCLR:  INTFCLR register
 *                          @arg I2C_REGISTER_PEC:      PEC register
 *                          @arg I2C_REGISTER_RXDATA:   RXDATA register
 *                          @arg I2C_REGISTER_TXDATA:   TXDATA register
 *
 * @retval      None
 */
uint32_t I2C_ReadRegister(I2C_T* i2c, uint8_t registers)
{
    __IO uint32_t temp = 0;

    temp = (uint32_t)i2c;
    temp += registers;

    return (*(__IO uint32_t*) temp);
}

/*!
 * @brief       Send a byte by writing in the TXDATA register
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C2/I2C3.
 *
 * @param       data:   Byte to be sent
 *
 * @retval      None
 */
void I2C_TxData(I2C_T* i2c, uint8_t data)
{
    i2c->TXDATA = (uint32_t)data;
}

/*!
 * @brief       Returns the most recent received data
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C2/I2C3.
 *
 * @retval      The value of the received byte data
 */
uint8_t I2C_RxData(I2C_T* i2c)
{
    return (uint8_t)i2c->RXDATA;
}

/*!
 * @brief       Enables the I2C DMA interface
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C2/I2C3.
 *
 * @param       request: DMA transfer request
 *                       The parameter can be one of following values:
 *                       @arg I2C_DMA_REQ_TX:   TX DMA Transmission request
 *                       @arg I2C_DMA_REQ_RX:   RX DMA Transmission request
 *
 * @retval      None
 */
void I2C_EnableDMA(I2C_T* i2c, I2C_DMA_REQ_T request)
{
    if (request == I2C_DMA_REQ_TX)
    {
        i2c->CTRL1_B.DMATXEN = BIT_SET;
    }
    else
    {
        i2c->CTRL1_B.DMARXEN = BIT_SET;
    }
}

/*!
 * @brief       Disables the I2C DMA interface
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C2/I2C3.
 *
 * @param       request: DMA transfer request
 *                       The parameter can be one of following values:
 *                       @arg I2C_DMA_REQ_TX:   TX DMA Transmission request
 *                       @arg I2C_DMA_REQ_RX:   RX DMA Transmission request
 *
 * @retval      None
 */
void I2C_DisableDMA(I2C_T* i2c, I2C_DMA_REQ_T request)
{
    if (request == I2C_DMA_REQ_TX)
    {
        i2c->CTRL1_B.DMATXEN = BIT_RESET;
    }
    else
    {
        i2c->CTRL1_B.DMARXEN = BIT_RESET;
    }
}

/*!
 * @brief       Checks whether the specified I2C flag is set or not
 *
 * @param       i2c: Select I2C peripheral,it can be I2C1/I2C2/I2C3.
 *
 * @param       flag:    Specifies the flag to check
 *                       The parameter can be one of following values:
 *                       @arg I2C_FLAG_TXBE:  Transmit buffer data register empty flag
 *                       @arg I2C_FLAG_TXINT: Transmit interrupt flag
 *                       @arg I2C_FLAG_RXBNE: Read buffer data register not empty flag
 *                       @arg I2C_FLAG_ADDR:  Address Sent/Matched (master/slave) flag
 *                       @arg I2C_FLAG_NACK:  Not acknowledge received flag
 *                       @arg I2C_FLAG_STOP:  Stop detected flag
 *                       @arg I2C_FLAG_TXCF:  Transfer complete flag
 *                       @arg I2C_FLAG_TCRF:  Transfer complete reload flag
 *                       @arg I2C_FLAG_BUSERR:Bus error flag
 *                       @arg I2C_FLAG_ALF:   Arbitration Loss flag
 *                       @arg I2C_FLAG_OVR:   Overrun/Underrun flag
 *                       @arg I2C_FLAG_PECERR:PEC error flag
 *                       @arg I2C_FLAG_TIMEOUT: Timeout or t_low detection flag
 *                       @arg I2C_FLAG_ALERT: SMBus alert flag
 *                       @arg I2C_FLAG_BUSY:  Bus Busy Flag
 *
 * @retval      Status of interrupt flag(SET or RESET)
 */
uint8_t I2C_ReadStatusFlag(I2C_T* i2c, I2C_FLAG_T flag)
{
    uint32_t status = 0;

    status = (uint32_t)(i2c->STS & (flag));

    if (status == flag )
    {
        return SET;
    }

